// 2. Логистический максимин
// Ваша компания занимается грузоперевозками в Швейцарских Альпах. Вам
// нужно доставить груз из пункта A в пункт Z на большом грузовике. Из A в Z
// ведёт несколько дорог, каждая из которых проходит через несколько
// туннелей известной высоты. Выясните максимальную высоту, которую
// может иметь ваш грузовик.
// Формат ввода
// На первой строке вводится количество дорог. Затем для каждой дороги
// вводится (на отдельных строках) количество туннелей и высота каждого
// туннеля (точнее, максимально допустимая высота грузовика) в сантиметрах.
// Формат вывода
// Два целых числа: номер дороги (начиная нумерацию с единицы), по которой
// нужно проехать, чтобы высота грузовика была наибольшей, и сама эта
// высота.
// Гарантируется, что ответ однозначный.
// Пример
//Ввод Вывод
// 2    2 450
// 3
// 470
// 430
// 465
// 2
// 451
// 450


fun main() {
    println("Введите количество дорог")
    val roadsCount: Int = readLine()!!.toInt()
    var maxHeight: Int = 0
    var maxIndex: Int = 0
    for (i in 1..roadsCount) {
        println("Введите количество туннелей для дороги $i")
        val tunnelsCount = readLine()!!.toInt()
        var minHeight = getMinHeight(tunnelsCount)
        if (minHeight > maxHeight) {
            maxHeight = minHeight
            maxIndex = i
        }
    }
    println("\nНомер дороги: $maxIndex")
    println("Высота грузовика: $maxHeight")
}

fun getMinHeight(tunnelsCount: Int): Int {
    var minHeight = 1000000
    for (j in 1..tunnelsCount) {
        println("Введите высоту туннеля $j")
        val height = readLine()!!.toInt()
        if (height < minHeight) {
            minHeight = height
        }
    }
    return minHeight
}