// 1. Сумма ряда
// C клавиатуры вводится натуральное число n > 0, потом n чисел, каждое на
// новой строке.
// Вычислите и напечатайте знакочередующуюся сумму ряда (первое число
// прибавить, второе вычесть, третье прибавить и т.д.) Например, для чисел
// 1,2,3,4 сумма будет следующей: 1 - 2 + 3 - 4 = -2.
// Пример 1
//Ввод Вывод
// 3   10
// 5
// 2
// 7

fun main() {
    println("Введите натуральное число n > 0")
    val n = readLine()!!.toInt()
    var sum = 0
    for (i in 1..n) {
        val num = readLine()!!.toInt()
        if (i % 2 == 0) {
            sum -= num
        } else {
            sum += num
        }
    }
    println("Сумма ряда: $sum")
}